/* 2152118 计科 史君宝 */

#include <iostream>
using namespace std;

int main()
{
	double y, m;
	int a,a50=0,a20=0,a10=0,a5=0,a1=0,b5=0,b1=0,c5=0,c2=0,c1=0,sum=0;
	cout << "请输入找零值：" << endl;
	cin >> y;
	a = int(y);
	m = y - a;
	if (a - 50 >= 0) 
	{
		a -= 50;
		a50++;
	}
	if (a - 20 >= 0) 
	{
		a -= 20;
		a20++;
	}
	if (a - 20 >= 0) 
	{
		a -= 20;
		a20++;
	}
	if (a - 10 >= 0) 
	{
		a -= 10;
		a10++;
	}
	if (a - 5 >= 0) 
	{
		a -= 5;
		a5++;
	}
	if (a - 1 >= 0) 
	{
		a -= 1;
		a1++;
	}
	if (a - 1 >= 0) 
	{
		a -= 1;
		a1++;
	}
	if (a - 1 >= 0) 
	{
		a -= 1;
		a1++;
	}
	if (a - 1 >= 0) 
	{
		a -= 1;
		a1++;
	}
	if (m - 0.5 >= 0) 
	{
		m -= 0.5;
		b5++;
	}
	if (m - 0.1 >= 0) 
	{
		m -= 0.1;
		b1++;
	}
	if (m - 0.1 >= 0) 
	{
		m -= 0.1;
		b1++;
	}
	if (m - 0.1 >= 0) 
	{
		m -= 0.1;
		b1++;
	}
	if (m - 0.1 >= 0) 
	{
		m -= 0.1;
		b1++;
	}
	if (m - 0.05 >= 0) 
	{
		m -= 0.05;
		c5++;
	}
	if (m - 0.02 >= 0) 
	{
		m -= 0.02;
		c2++;
	}
	if (m - 0.02 >= 0) 
	{
		m -= 0.02;
		c2++;
	}
	if (m - 0.01 >= 0) 
	{
		m -= 0.01;
		c1++;
	}
	sum = a50 + a20 + a10 + a5 + a1 + b5 + b1 + c5 + c2 + c1;
	cout << "共" << sum << "张找零，具体如下：" << endl;
	if (a50 != 0)
		cout << "50元 : " << a50 << "张" << endl;
	if (a20 != 0)
		cout << "20元 : " << a20 << "张" << endl;
	if (a10 != 0)
		cout << "10元 : " << a10 << "张" << endl;
	if (a5 != 0)
		cout << "5元  : " << a5 << "张" << endl;
	if (a1 != 0)
		cout << "1元  : " << a1 << "张" << endl;
	if (b5 != 0)
		cout << "5角  : " << b5 << "张" << endl;
	if (b1 != 0)
		cout << "1角  : " << b1 << "张" << endl;
	if (c5 != 0)
		cout << "5分  : " << c5 << "张" << endl;
	if (c2 != 0)
		cout << "2分  : " << c2 << "张" << endl;
	if (c1 != 0)
		cout << "1分  : " << c1 << "张" << endl;

	return 0;
}